/*

План дій:

- додати косметику, моделі, текстури, партікли, звуки



Done:

05.06

- повністю робочий UI (маю на увазі що всі кнопки працюють, переходить з одного в інший, логіка гри працює)
- робоча система підбахунку балів (зірок), трохи "на колінці" і не збалансована але робоча +-
- стрільба реалізована через тачскрін, але не через кнопку -перевірив на своєму телефоні - працює як треба (наче)
- по суті готово, треба тільки косметики навалить і все

ПЗ:

+- При затисканні пальця у великій області екрана випускаємо множинні снаряди з невеликою затримкою.
+ Достатньо одного рівня. (зроблений рандомайз)
+ Можна отримати від 0 до 3 зірок за проходження рівня залежно від того, за який час він був пройдений (наприклад, за 100 секунд - 3, 120 секунд - 2, 150 секунд - 1, більше 150 - не пройшов).
+ Зверху всіх блоків знаходиться скриня, яка розбивається за кілька пострілів. Її розбиття вважається закінченням рівня.
+ Можна додати обмеження на кількість снарядів і показати кількість снарядів, що залишилися, текстом. (до цього пункту дуже багато питань, тому замінив це діло звичайним хп  у самого гравця) (просто якщо є обмеження по часу, є хп у гравця, то нашо обмежувати ще й снаряди які навіть не можуть полетіти в нікуди???)




04.06

Куля:
+1. постріл на затиснуту клавішу із затримкою 
+2. постріл реалізувати через модифікатор вектору
+3. додати влучання в ціль
+4. додати влучання в щит та обернений політ в гравця
+5. додати влучання в гравця
+6. самостійне знищення кулі через умовні 3 секунди

Ціль:
+1. має бути абстрактний клас
+2. додати логіку знищення по закінченню хп
+3. додати логіку переміщення вниз на свою висоту, якщо блок знизу знищено
+4. додати анімації зіткнення з кулею та знищення (модифікація по скейлу)
+5. додати текст на префаби зі значенням хп

Щит:
+1. Це окремий клас
+2. конфігурації зі щитами треба засунути в префаби
+3. всяке різне обертання зробити анімацією, яка буде обиратись рандомно при генерації
+4. типи обертання:
    постійне в одну сторону, туди-сюди з плавним затуханням, постійне в одну сторону з короткими зупинками кожні 45 градусів
+5. компоненти щиту - це цілі які теж виконують анімації при влучанні

Генератор:
+1. збірка рівня  яка буде рандомити блоки а в кінці генерувати TreasureBox
+2. щити теж мають бути згенеровані і задана анімація руху
?3. гравець теж десь тут має включатись
+4. збірка має бути по рандомним числам (висота цієї умовної башні)

ПЗ:

+Генеруються блоки один на одному у вигляді вежі з примітивних кубів.
+Не обов'язково використовувати фізику.
+Перешкоди обертаються навколо вежі та блокують снаряди при влучанні.
+Під час розбиття одного блоку всі блоки зверху швидко зміщуються вниз із мінімальною затримкою або взагалі без неї.


part2

- створено основу для UI для всії можливих сценаріїв
- зроблено екран з відліком
- купа всякого стосовно ui та його логіки, але ще нічо не підключено

пушу бо вирубило світло і треба залити доки ноут не здох


*/